//36. 有效的数独
//判断一个 9x9 的数独是否有效。只需要根据以下规则，验证已经填入的数字是否有效即可。
//
//数字 1-9 在每一行只能出现一次。
//数字 1-9 在每一列只能出现一次。
//数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。
//
//
//上图是一个部分填充的有效的数独。
//
//数独部分空格内已填入了数字，空白格用 '.' 表示。
//
//示例 1:
//
//输入:
//[
//  ["5","3",".",".","7",".",".",".","."],
//  ["6",".",".","1","9","5",".",".","."],
//  [".","9","8",".",".",".",".","6","."],
//  ["8",".",".",".","6",".",".",".","3"],
//  ["4",".",".","8",".","3",".",".","1"],
//  ["7",".",".",".","2",".",".",".","6"],
//  [".","6",".",".",".",".","2","8","."],
//  [".",".",".","4","1","9",".",".","5"],
//  [".",".",".",".","8",".",".","7","9"]
//]
//输出: true
//示例 2:
//
//输入:
//[
//  ["8","3",".",".","7",".",".",".","."],
//  ["6",".",".","1","9","5",".",".","."],
//  [".","9","8",".",".",".",".","6","."],
//  ["8",".",".",".","6",".",".",".","3"],
//  ["4",".",".","8",".","3",".",".","1"],
//  ["7",".",".",".","2",".",".",".","6"],
//  [".","6",".",".",".",".","2","8","."],
//  [".",".",".","4","1","9",".",".","5"],
//  [".",".",".",".","8",".",".","7","9"]
//]
//输出: false
//解释: 除了第一行的第一个数字从 5 改为 8 以外，空格内其他数字均与 示例1 相同。
//     但由于位于左上角的 3x3 宫内有两个 8 存在, 因此这个数独是无效的。
//说明:
//
//一个有效的数独（部分已被填充）不一定是可解的。
//只需要根据以上规则，验证已经填入的数字是否有效即可。
//给定数独序列只包含数字 1-9 和字符 '.' 。
//给定数独永远是 9x9 形式的。

//解题思路
//1、数独分校验分三个方面，9个横向、9个纵向、33九宫格正方形
//2、设置变量保存没格校验结果，初始为0，出现后置1，若已置1，则返回false;
//3、每格对应的33九宫格为[x/3][y/3]；
//4、遍历后无异常返回true;
//
//执行用时：
//8 ms, 在所有 C 提交中击败了99.47%的用户
//内存消耗：
//5.5 MB, 在所有 C 提交中击败了59.53%的用户

bool isValidSudoku(char** board, int boardSize, int* boardColSize) {
  char x[9][9] = {0};
  char y[9][9] = {0};
  char squre[3][3][9] = {0};
  int i, j, num, squrex, squrey;
  for (i = 0; i < 9; i++) {
    for (j = 0; j < 9; j ++) {
      if (board[i][j] == '.') {
        continue;
      }
      squrex = (int)(i/3);
      squrey = (int)(j/3);
      num = (int)(board[i][j] - '1');
      if (x[i][num] == 1 || y[j][num] == 1 || squre[squrex][squrey][num] == 1) {
        return false;
      }
      x[i][num] = 1;
      y[j][num] = 1;
      squre[squrex][squrey][num] = 1;
    }
  }
  return true;
}
//
//作者：boxer-a
//链接：https://leetcode-cn.com/problems/valid-sudoku/solution/yi-ci-bian-li-wan-cheng-pan-duan-by-boxer-a/
//来源：力扣（LeetCode）
//著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。

